In [1]:
import pandas as pd

In [33]:
df = pd.DataFrame({"Number": [1,2,3,"?",2,4],
             "Class":[10,12,13,14,15,16]})

In [34]:
df

  Number  Class
0      1     10
1      2     12
2      3     13
3      ?     14
4      2     15
5      4     16

In [35]:
df[df["Number"]!="?"].mean()[0]

2.4

In [36]:
df["Number"].replace("?",df[df["Number"]!="?"].mean()[0], inplace = True)

In [37]:
df

   Number  Class
0     1.0     10
1     2.0     12
2     3.0     13
3     2.4     14
4     2.0     15
5     4.0     16